[
  {
    "id": "testimonial-1",
    "name": "Barbara H.",
    "company": "Turtle Creek Resident",
    "role": "Senior Resident",
    "content": "I was nervous about setting up my new smartphone, but Three Rivers Tech was so patient with me. They showed me how to video chat with my grandkids and even set up my email. They're true neighbors helping neighbors.",
    "rating": 5,
    "service": "home-support",
    "image": "/images/testimonials/barbara-h.jpg"
  },
  {
    "id": "testimonial-2", 
    "name": "Mike T.",
    "company": "Turtle Creek Hardware",
    "role": "Store Owner",
    "content": "Our small hardware store needed an online presence. Three Rivers Tech built us a simple website that looks great and helps customers find us. The price was fair and they explained everything clearly. Local businesses need more partners like them.",
    "rating": 5,
    "service": "web-development",
    "image": "/images/testimonials/mike-t.jpg"
  },
  {
    "id": "testimonial-3",
    "name": "Jennifer W.",
    "company": "Wilmerding Resident",
    "role": "Working Parent", 
    "content": "When my laptop crashed right before a work deadline, Three Rivers Tech came to my home the same day. They fixed it quickly and set up a backup system so this won't happen again. Their local service is amazing!",
    "rating": 5,
    "service": "home-support",
    "image": "/images/testimonials/jennifer-w.jpg"
  },
  {
    "id": "testimonial-4",
    "name": "Robert C.",
    "company": "Robert's Tutoring",
    "role": "Tutor",
    "content": "I help local students with online learning, but my old computer was too slow. Three Rivers Tech not only fixed it but optimized it for educational software. Now I can help more kids in our community. They understand our needs.",
    "rating": 5,
    "service": "home-support",
    "image": "/images/testimonials/robert-c.jpg"
  },
  {
    "id": "testimonial-5",
    "name": "Amanda F.",
    "company": "Wilmerding Bakery",
    "role": "Owner", 
    "content": "Three Rivers Tech helped set up our point-of-sale system and inventory tracking. They explained everything so my staff could use it easily. As a small business owner, I appreciate having a tech partner who understands our budget.",
    "rating": 5,
    "service": "small-business-it",
    "image": "/images/testimonials/amanda-f.jpg"
  },
  {
    "id": "testimonial-6",
    "name": "Tom B.",
    "company": "Turtle Creek Auto Repair",
    "role": "Mechanic",
    "content": "I needed a simple website that would help customers find my auto shop online. Three Rivers Tech built something affordable that looks professional and gets me new customers. They're true hometown tech partners.",
    "rating": 5,
    "service": "web-development",
    "image": "/images/testimonials/tom-b.jpg"
  }
]